app/views/guitars/_favorites.html.erb

<ol>
  <% guitar.guitar_comments.each do |guitar_comment| %>
---
SELECT "guitars".* FROM "guitars"
SELECT "guitar_comments".* FROM "guitar_comments" WHERE "guitar_comments"."guitar_id" = ?  [["guitar_id", 1]]