app/views/guitars/index.html.erb

				     <ul class="inline-meta">
                        <%= link_to "コメント数　#{guitar.guitar_comments.count}", guitar_path(guitar.id) %>
---
SELECT "guitars".* FROM "guitars"
SELECT COUNT(*) FROM "guitar_comments" WHERE "guitar_comments"."guitar_id" = ?  [["guitar_id", 1]]