app/views/guitars/show.html.erb

SELECT COUNT(*) FROM "guitar_comments" WHERE "guitar_comments"."guitar_id" = ?  [["guitar_id", 1]]
---
             <td>
              <div class="comment-count">コメント数：<%= @guitar.guitar_comments.count %></div>