app/controllers/guitar_comments_controller.rb

  def create
    guitar = Guitar.find(params[:guitar_id])
    comment = current_user.guitar_comments.new(guitar_comment_params)
    comment.guitar_id = guitar.id
    if comment.save
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "guitar_comments" ("user_id", "guitar_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["guitar_id", 1], ["comment", "tr"], ["created_at", "2020-12-13 13:06:02.742176"], ["updated_at", "2020-12-13 13:06:02.742176"]]

  def destroy
    GuitarComment.find_by(id: params[:id], guitar_id: params[:guitar_id]).destroy
---
DELETE FROM "guitar_comments" WHERE "guitar_comments"."id" = ?  [["id", 1]]
SELECT  "guitar_comments".* FROM "guitar_comments" WHERE "guitar_comments"."id" = ? AND "guitar_comments"."guitar_id" = ? LIMIT ?  [["id", 1], ["guitar_id", 1], ["LIMIT", 1]]